In [5]:
import numpy as np
import pandas as pd
from pandas import Series

In [17]:
data1 = np.random.randint(3,10,5)
idx = ['a','b','c','d','e']
s1 = Series(data1,index = idx)
s1

a    8
b    5
c    6
d    9
e    3
dtype: int32

In [18]:
s1.tail(3)

c    6
d    9
e    3
dtype: int32

In [19]:
s1['c':'e']

c    6
d    9
e    3
dtype: int32

In [21]:
s1[-3:]

c    6
d    9
e    3
dtype: int32

In [24]:
dt1={'year':[2017,2018,2019],'price':[10,20,30]}
print(pd.DataFrame(dt1,index = ['0','1','2']))

   year  price
0  2017     10
1  2018     20
2  2019     30

In [27]:
data2 = np.random.randint(5,15,(5,3))
df_test = pd.DataFrame(data2,index=['a', 'c', 'e', 'f', 'h'],columns =['one', 'two', 'three'])
df_test

   one  two  three
a    5   10      5
c   10    5      9
e   11    6      5
f    9   13     14
h   13   12      9

In [35]:
df_test.loc['a','one']=None
df_test.loc['c','two']=-99
df_test.loc['c','three']=-99
df_test.loc['a','two']=-100
df_test.loc[:,'four']= 'test'
df_change = df_test.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df_change

    one    two  three  four
a   NaN -100.0    5.0  test
b   NaN    NaN    NaN   NaN
c  10.0  -99.0  -99.0  test
d   NaN    NaN    NaN   NaN
e  11.0    6.0    5.0  test
f   9.0   13.0   14.0  test
g   NaN    NaN    NaN   NaN
h  13.0   12.0    9.0  test

In [38]:
df6=df_change.dropna()
df6

    one   two  three  four
c  10.0 -99.0  -99.0  test
e  11.0   6.0    5.0  test
f   9.0  13.0   14.0  test
h  13.0  12.0    9.0  test

In [39]:
df7 = df_change.dropna(how = 'all')
df7

    one    two  three  four
a   NaN -100.0    5.0  test
c  10.0  -99.0  -99.0  test
e  11.0    6.0    5.0  test
f   9.0   13.0   14.0  test
h  13.0   12.0    9.0  test

In [40]:
df8 = df_change.fillna(0)
df8

    one    two  three  four
a   0.0 -100.0    5.0  test
b   0.0    0.0    0.0     0
c  10.0  -99.0  -99.0  test
d   0.0    0.0    0.0     0
e  11.0    6.0    5.0  test
f   9.0   13.0   14.0  test
g   0.0    0.0    0.0     0
h  13.0   12.0    9.0  test

In [41]:
df9 = df_change.drop_duplicates()
df9

    one    two  three  four
a   NaN -100.0    5.0  test
b   NaN    NaN    NaN   NaN
c  10.0  -99.0  -99.0  test
e  11.0    6.0    5.0  test
f   9.0   13.0   14.0  test
h  13.0   12.0    9.0  test